src_Extension/Reports/Расш1_Плановая_калькуляция_сквозная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>Расш1_Плановая_калькуляция_сквозная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументВладелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановаяКалькуляция2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурснаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/Reports/Расш1_Плановая_калькуляция_сквозная/Ext/ObjectModule.bsl
&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;    
		

	// Сначала берем значения из реквизитов отчета
	Номенклатура = ЭтотОбъект.Номенклатура;
	РесурснаяСпецификация = ЭтотОбъект.РесурснаяСпецификация;
	Количество = ?(ЭтотОбъект.Количество > 0, ЭтотОбъект.Количество, 1);
		
	Настройки = КомпоновщикНастроек.Настройки;   
	
	ДокументВладелец = ЭтотОбъект.ДокументВладелец;
	
	// Если выбрана номенклатура, но не выбрана спецификация - подбираем приоритетную на сегодня
	Если НЕ Номенклатура = Справочники.Номенклатура.ПустаяСсылка() 
		И РесурснаяСпецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка() Тогда
		РесурснаяСпецификация = Расш1_ОбщийМодуль1.ПриоритетнаяСпецификация(Номенклатура, ТекущаяДатаСеанса());
	КонецЕсли;	
	
	Если РесурснаяСпецификация = Неопределено ИЛИ РесурснаяСпецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка() Тогда 
		 
		Структура = Расш1_ОбщийМодульКалькуляция.ТаблицыМатериаловИТрудозатратИтоговые(ДокументВладелец);     
		
		Попытка 
			
			ТаблицаМатериаловИУслуг = Структура.ТаблицаМатериаловИУслуг;
			ТаблицаТрудозатрат = Структура.ТаблицаТрудозатрат; 
			
			ВнешниеНаборыДанных = Новый Структура;
			ВнешниеНаборыДанных.Вставить("ТаблицаМатериаловИУслуг", ТаблицаМатериаловИУслуг);
			ВнешниеНаборыДанных.Вставить("ТаблицаТрудозатрат", ТаблицаТрудозатрат);
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
			
			// Проверяем, что макет компоновки не пустой
			Если МакетКомпоновки.НаборыДанных.Количество() = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Отчет не сформирован. Включите хотя бы одну группировку в настройках отчета.';
										|en = 'Report is not generated. Include at least one grouping in report settings.'");
			КонецЕсли;
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			
			// Вывод описания параметров под отчётом
			ВывестиОписаниеПараметров(ДокументРезультат);
			
		Исключение
			Сообщить("Ошибка получения данных документа: " + ДокументВладелец + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;		
	Иначе
		Структура = Расш1_ОбщийМодульКалькуляция.ТаблицыМатериаловИТрудозатратПоПараметрам(ДокументВладелец, РесурснаяСпецификация, Количество);
		Попытка 
			
			ТаблицаМатериаловИУслуг = Структура.ТаблицаМатериаловИУслуг;
			ТаблицаТрудозатрат = Структура.ТаблицаТрудозатрат; 
			
			ВнешниеНаборыДанных = Новый Структура;
			ВнешниеНаборыДанных.Вставить("ТаблицаМатериаловИУслуг", ТаблицаМатериаловИУслуг);
			ВнешниеНаборыДанных.Вставить("ТаблицаТрудозатрат", ТаблицаТрудозатрат);
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
			
			// Проверяем, что макет компоновки не пустой
			Если МакетКомпоновки.НаборыДанных.Количество() = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Отчет не сформирован. Включите хотя бы одну группировку в настройках отчета.';
										|en = 'Report is not generated. Include at least one grouping in report settings.'");
			КонецЕсли;
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			
			// Вывод описания параметров под отчётом
			ВывестиОписаниеПараметров(ДокументРезультат);
			
		Исключение
			Сообщить("Ошибка получения данных РесурснаяСпецификация: " + РесурснаяСпецификация + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОписаниеПараметров(ДокументРезультат)
	
	ТекстОписания = "
	|
	|Описание параметров отчета
	|==========================
	|
	|Отчет показывает плановую калькуляцию изделия - материалы/услуги и трудозатраты.
	|Спецификация разворачивается рекурсивно (дерево полуфабрикатов) до конечных материалов.
	|
	|РЕЖИМЫ РАБОТЫ
	|-------------
	|1. По документу - если не указана спецификация, берет данные из документа
	|   плановой калькуляции (объекты калькуляции из табличной части документа)
	|
	|2. По спецификации - если указана спецификация (или номенклатура),
	|   рассчитывает калькуляцию по дереву спецификации
	|
	|ПАРАМЕТРЫ
	|---------
	|НОМЕНКЛАТУРА - изделие для калькуляции:
	|  * При выборе автоматически подбирается приоритетная спецификация на текущую дату
	|
	|РЕСУРСНАЯ СПЕЦИФИКАЦИЯ - спецификация изделия:
	|  * Если не указана - данные берутся из документа-владельца
	|  * Если указана - калькуляция рассчитывается по дереву этой спецификации
	|
	|КОЛИЧЕСТВО - количество изделий для расчета:
	|  * По умолчанию 1
	|  * Влияет на расчет общей потребности в материалах и трудозатратах
	|
	|РАСЧЕТ КАЛЬКУЛЯЦИИ
	|------------------
	|  * Цены материалов берутся по виду цены из документа-владельца
	|  * Трудозатраты рассчитываются с учетом плановых процентов премии и за вредность
	|  * Стоимость материалов = Цена * Количество
	|  * Стоимость за единицу изделия = Стоимость / Количество изделий
	|
	|ТАБЛИЦЫ ОТЧЕТА
	|--------------
	|  * Материалы и услуги - номенклатура, количество, цена, стоимость, статья калькуляции
	|  * Трудозатраты - нормочасы, расценки, стоимость труда по этапам спецификации
	|";
	
	// Вывод текста описания построчно
	СтрокиОписания = СтрРазделить(ТекстОписания, Символы.ПС, Ложь);
	Для Каждого СтрокаОписания Из СтрокиОписания Цикл
		МакетСтроки = Новый ТабличныйДокумент;
		ОбластьСтроки = МакетСтроки.ПолучитьОбласть(1, 1, 1, 1);
		ОбластьСтроки.Область(1, 1).Текст = СтрокаОписания;
		ОбластьСтроки.Область(1, 1).ЦветТекста = WebЦвета.Серый;
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
КонецПроцедуры
